app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 980190963]]
---
<ul>
    <% @cart.line_items.each do |item| %>