app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def create
    session[:counter] = 0

    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 207281424], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-25 23:06:01.853815"], ["updated_at", "2017-12-25 23:06:01.853815"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2017-12-25 23:06:01.878608"], ["updated_at", "2017-12-25 23:06:01.878608"]]

  def destroy
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]