app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
---
  def index
    @count = increment_counter
    @products = Product.order(:title)